openfoam_ex/cavityHeat/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// d = 2.0, |U| = 1.0, Re = 1000, nu = d * abs(U) / Re
nu              [0 2 -1 0 0 0 0] 0.002;

beta            [0 0 0 -1 0 0 0] 1e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              1.0;


// Turbulent Prandtl number
Prt             1.0;

// ************************************************************************* //
